{
  "_class_name": "OotdPipeline",
  "_diffusers_version": "0.24.0.dev0",
  "_name_or_path": "/home/aigc/levi/OOTDemo/Checkpoints/OOTDiffusion",
  "feature_extractor": [
    "transformers",
    "CLIPImageProcessor"
  ],
  "requires_safety_checker": true,
  "safety_checker": [
    "stable_diffusion",
    "StableDiffusionSafetyChecker"
  ],
  "scheduler": [
    "diffusers",
    "PNDMScheduler"
  ],
  "text_encoder": [
    "transformers",
    "CLIPTextModel"
  ],
  "tokenizer": [
    "transformers",
    "CLIPTokenizer"
  ],
  "unet_garm": [
    "pipelines_ootd.unet_garm_2d_condition",
    "UNetGarm2DConditionModel"
  ],
  "unet_vton": [
    "pipelines_ootd.unet_vton_2d_condition",
    "UNetVton2DConditionModel"
  ],
  "vae": [
    "diffusers",
    "AutoencoderKL"
  ]
}